[{
        "id": 1,
    "type": "movies",
        "title": "ALITA: BATTLE ANGEL",
        "year": "2019",
        "release_date": "January 31, 2019",
        "runtime": "122",
        "genres": "Action, Science Fiction, Adventure",
        "director": "Robert Rodriguez",
        "actors": "Rosa Salazar, Christoph Waltz, Jennifer Connelly, Mahershala Ali",
        "plot": "When Alita awakens with no memory of who she is in a future world she does not recognize, she is taken in by Ido, a compassionate doctor who realizes that somewhere in this abandoned cyborg shell is the heart and soul of a young woman with an extraordinary past.",
        "poster": "poster_alita"
    },
    {
        "id": 2,
        "type": "movies",
        "title": "AQUAMAN",
        "year": "2018",
        "release_date": "July 6, 2018",
        "runtime": "143",
        "genres": "Action, Adventure, Fantasy",
        "director": "James Wan",
        "actors": "Jason Momoa, Amber Heard, Willem Dafoe, Patrick Wilson",
        "plot": "Once home to the most advanced civilization on Earth, Atlantis is now an underwater kingdom ruled by the power-hungry King Orm. With a vast army at his disposal, Orm plans to conquer the remaining oceanic people and then the surface world. Standing in his way is Arthur Curry, Orm's half-human, half-Atlantean brother and true heir to the throne.",
        "poster": "poster_aquaman"
    },
    {
        "id": 3,
        "type": "movies",
        "title": "A STAR IS BORN",
        "year": "2018",
        "release_date": "October 3, 2018",
        "runtime": "136",
        "genres": "Drama, Romance",
        "director": "Bradley Cooper",
        "actors": "Bradley Cooper, Lady Gaga, Sam Elliott, Andrew Dice Clay",
        "plot": "Seasoned musician Jackson Maine discovers — and falls in love with — struggling artist Ally. She has just about given up on her dream to make it big as a singer — until Jack coaxes her into the spotlight. But even as Ally's career takes off, the personal side of their relationship is breaking down, as Jack fights an ongoing battle with his own internal demons.",
        "poster": "poster_a_star_is_born"
    },
    {
        "id": 4,
        "type": "movies",
        "title": "BOHEMIAN RHAPSODY",
        "year": "2018",
        "release_date": "October 24, 2018",
        "runtime": "135",
        "genres": "Music, Drama, History",
        "director": "Bryan Singer",
        "actors": "Rami Malek, Gwilym Lee, Ben Hardy, Joseph Mazello",
        "plot": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.",
        "poster": "poster_bohemian"
    },
    {
        "id": 5,
        "type": "movies",
        "title": "COLD PURSUIT",
        "year": "2019",
        "release_date": "February 7, 2019",
        "runtime": "119",
        "genres": "Action, Crime, Thriller",
        "director": "Hans Petter Moland",
        "actors": "Liam Neeson, Laura Dern, Emmy Rossum, Michael Eklund",
        "plot": "The quiet family life of Nels Coxman, a snowplow driver, is upended after his son's murder. Nels begins a vengeful hunt for Viking, the drug lord he holds responsible for the killing, eliminating Viking's associates one by one. As Nels draws closer to Viking, his actions bring even more unexpected and violent consequences, as he proves that revenge is all in the execution.",
        "poster": "poster_cold_pursuit"
    },
    {
        "id": 6,
        "type": "movies",
        "title": "CREED II",
        "year": "2018",
        "release_date": "November 21, 2018",
        "runtime": "130",
        "genres": "Drama",
        "director": "Steven Caple Jr.",
        "actors": "Michael B. Jordan, Syvester Stallone, Dolph Lundgren, Florian Munteanu",
        "plot": "Between personal obligations and training for his next big fight against an opponent with ties to his family's past, Adonis Creed is up against the challenge of his life.",
        "poster": "poster_creed"
    },
    {
        "id": 7,
        "type": "movies",
        "title": "FANTASTIC BEAST: THE CRIMES OF GRINDELWALD",
        "year": "2018",
        "release_date": "November 16, 2018",
        "runtime": "134",
        "genres": "Adventure, Fantasy, Drama",
        "director": "David Yates",
        "actors": "Eddie Redmayne, Katherine Waterston, Dan Fogler, Alison Sudol",
        "plot": "Gellert Grindelwald has escaped imprisonment and has begun gathering followers to his cause—elevating wizards above all non-magical beings. The only one capable of putting a stop to him is the wizard he once called his closest friend, Albus Dumbledore. However, Dumbledore will need to seek help from the wizard who had thwarted Grindelwald once before, his former student Newt Scamander, who agrees to help, unaware of the dangers that lie ahead. Lines are drawn as love and loyalty are tested, even among the truest friends and family, in an increasingly divided wizarding world.",
        "poster": "poster_crimes"
    },
    {
        "id": 8,
        "type": "movies",
        "title": "GLASS",
        "year": "2019",
        "release_date": "January 18, 2019",
        "runtime": "129",
        "genres": "Thriller, Drama, Science Fiction",
        "director": "M. Night Shymalan",
        "actors": "James McAvoy, Bruce Willis, Samuel L. Jackson, Anya Taylor Joy",
        "plot": "In a series of escalating encounters, former security guard David Dunn uses his supernatural abilities to track Kevin Wendell Crumb, a disturbed man who has twenty-four personalities. Meanwhile, the shadowy presence of Elijah Price emerges as an orchestrator who holds secrets critical to both men.",
        "poster": "poster_glass"
    },
    {
        "id": 9,
        "type": "movies",
        "title": "HOW TO TRAIN YOUR DRAGON",
        "year": "2010",
        "release_date": "March 26, 2010",
        "runtime": "98",
        "genres": "Fantasy, Anventure, Animation, Family",
        "director": "Chris Sanders",
        "actors": "Jay Baruchel, Gerard Butler, Craig Fergusin, America Ferrera",
        "plot": "As the son of a Viking leader on the cusp of manhood, shy Hiccup Horrendous Haddock III faces a rite of passage: he must kill a dragon to prove his warrior mettle. But after downing a feared dragon, he realizes that he no longer wants to destroy it, and instead befriends the beast – which he names Toothless – much to the chagrin of his warrior father",
        "poster": "poster_how_to_train"
    },
    {
        "id": 10,
        "type": "movies",
        "title": "AVENGERS: INFINITY WAR",
        "year": "2018",
        "release_date": "April 27, 2018",
        "runtime": "149",
        "genres": "Adventure, Action, Science Fiction",
        "director": "Anthony Russo",
        "actors": "Robert Downey Jr., Mark Ruffalo, Chris Hemsworth, Chris Evans",
        "plot": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.",
        "poster": "poster_infinity_war"
    },
    {
        "id": 11,
        "type": "movies",
        "title": "MARRY QUEEN",
        "year": "2018",
        "release_date": "December 21, 2018",
        "runtime": "124",
        "genres": "Drama, History",
        "director": "Josie Rourke",
        "actors": "Saoirse Ronan, Margot Robbie, Jack Lowden, Joe Alwyn",
        "plot": "In 1561, Mary Stuart, widow of the King of France, returns to Scotland, reclaims her rightful throne and menaces the future of Queen Elizabeth I as ruler of England, because she has a legitimate claim to the English throne. Betrayals, rebellions, conspiracies and their own life choices imperil both Queens. They experience the bitter cost of power, until their tragic fate is finally fulfilled.",
        "poster": "poster_marry_queen"
    },
    {
        "id": 12,
        "type": "movies",
        "title": "MASTER Z: IP MAN LEGACY",
        "year": "2018",
        "release_date": "December 26, 2018",
        "runtime": "107",
        "genres": "Action",
        "director": "Yuen Woo Ping",
        "actors": "Zhang Jin, Dave Bautista, Liu yan, Xing Yu",
        "plot": "Following his defeat by Master Ip, Cheung Tin Chi tries to make a life with his young son in Hong Kong, waiting tables at a bar that caters to expats. But it's not long before the mix of foreigners, money, and triad leaders draw him once again to the fight.",
        "poster": "poster_master_z"
    },
    {
        "id": 13,
        "type": "movies",
        "title": "MORTAL ENGINES",
        "year": "2018",
        "release_date": "December 14, 2018",
        "runtime": "129",
        "genres": "Adventure, Science Fiction",
        "director": "Christian Rivers",
        "actors": "Hera Hilmar, Robert Sheehan, Hugo Weaving, Jihae",
        "plot": "Many thousands of years in the future, Earth’s cities roam the globe on huge wheels, devouring each other in a struggle for ever diminishing resources. On one of these massive traction cities, the old London, Tom Natsworthy has an unexpected encounter with a mysterious young woman from the wastelands who will change the course of his life forever.",
        "poster": "poster_mortal_engines"
    }
]